In [1]:
from database_utils import DatabaseConnector
from data_extraction import DataExtractor
from data_cleaning import DataCleaning
import numpy as np
import pandas as pd

In [2]:
db_cleaned = DatabaseConnector('credentials/db_creds_cleaned.yaml')
db_cleaned.list_db_tables()

['dim_users',
 'dim_card_details',
 'dim_store_details',
 'dim_products',
 'orders_table',
 'dim_date_times']

## Query 1 - How many stores does the business have and in which countries?

In [3]:
db_cleaned.return_query_from_file('num_stores_which_countries')

  country  total_no_stores
0      GB              258
1      DE              140
2      US               34
3    None                1

## Query 2 - Which locations currently have the most stores?

In [4]:
db_cleaned.return_query_from_file('num_stores_which_locality')

       locality  total_no_stores
0    Chapletown               14
1        Belper               13
2        Exeter               11
3        Bushey               10
4  High Wycombe               10
5      Arbroath               10
6    Rutherglen                9

## Query 3 - Which months produced the largest amount of sales?

In [5]:
db_cleaned.return_query_from_file('largest_sales_per_month')

   total_sales month
0     89264.65     3
1     88880.55     8
2     87309.09     1
3     86182.65    10
4     83090.69    12
5     81265.48     5
6     80488.42     7
7     80143.26     4
8     78752.70     2
9     77694.96    11
10    76563.32     9
11    74318.31     6

## Query 4 - How many sales are coming from online?

In [6]:
db_cleaned.return_query_from_file('how_many_online_sales')

   number_of_sales  product_quantity_count store_category
0            11710                   46841        Offline
1             3380                   13633         Online

## Query 5 - What percentage of sales come through each type of store?

In [8]:
db_cleaned.return_query_from_file('percentage_sales_which_store')

    store_type total_sales sales_made(%)
0        Local   432991.65         44.31
1       Online   224071.47         22.40
2  Super Store   147379.19         15.31
3   Mall Kiosk    98443.33          9.75
4       Outlet    81068.44          8.22

## Query 6 - Which month in each year produced the highest cost of sales?

In [9]:
db_cleaned.return_query_from_file('best_month_each_year')

  total_sales  year month
0     5665.02  2006     8
1     5395.82  1997    11
2     5157.96  2000     3
3     5049.72  1996     8
4     4960.25  1994     3
5     4779.60  2008     6
6     4695.98  2019     7
7     4694.23  2019     8
8     4545.51  2020     3
9     4507.85  1999     5

## Query 7 - What is our staff headcount?

In [12]:
db_cleaned.return_query_from_file('num_staff_per_country')

   total_staff_numbers country_code
0                12725           GB
1                 6098           DE
2                 1384           US

## Query 8 - Which German store type is selling the most?

In [19]:
db_cleaned.return_query_from_file('best_german_store_type')

  total_sales   store_type country_code
0    28390.13       Outlet           DE
1    30337.15   Mall Kiosk           DE
2    51229.26  Super Store           DE
3   140605.24        Local           DE

## Query 9 - How quickly is the company making sales?

In [29]:
db_cleaned.return_query_from_file('how_quick_make_sales')

   year      actual_time_taken
0  1992 0 days 13:55:30.253731
1  2009 0 days 16:10:59.422642
2  2018 0 days 16:32:38.395437
3  2010 0 days 16:39:49.561069
4  2012 0 days 16:43:28.850575
5  2006 0 days 16:46:21.518235
6  2014 0 days 16:53:52.249513
7  1998 0 days 16:57:58.262136
8  2022 0 days 17:01:09.052631
9  2020 0 days 17:01:33.492218